#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.data.aws_availability_zones.available: Reading...
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Reading...
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Read complete after 0s [id=3552664922]
module.eks.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.carguero-technical-challenge will be created
  + resource "aws_eks_cluster" "carguero-technical-challenge" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "carguero-technical-challenge-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = {
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + version               = "1.27"

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[0] will be created
  + resource "aws_eks_node_group" "carguero-technical-challenge-node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "carguero-technical-challenge-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "carguero-technical-challenge-node-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "carguero-technical-challenge-node-1"
        }
      + tags_all               = {
          + "Name"    = "carguero-technical-challenge-node-1"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 2
        }
    }

  # module.eks.aws_iam_role.carguero-technical-challenge-iam-role will be created
  + resource "aws_iam_role" "carguero-technical-challenge-iam-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "carguero-technical-challenge-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.carguero-technical-challenge-node-role will be created
  + resource "aws_iam_role" "carguero-technical-challenge-node-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "carguero-technical-challenge-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cluster-policy will be created
  + resource "aws_iam_role_policy_attachment" "carguero-technical-challenge-cluster-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "carguero-technical-challenge-role"
    }

  # module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cni-policy will be created
  + resource "aws_iam_role_policy_attachment" "carguero-technical-challenge-cni-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "carguero-technical-challenge-node-role"
    }

  # module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-node-policy will be created
  + resource "aws_iam_role_policy_attachment" "carguero-technical-challenge-node-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "carguero-technical-challenge-node-role"
    }

  # module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-registry-policy will be created
  + resource "aws_iam_role_policy_attachment" "carguero-technical-challenge-registry-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "carguero-technical-challenge-node-role"
    }

  # module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-service-policy will be created
  + resource "aws_iam_role_policy_attachment" "carguero-technical-challenge-service-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "carguero-technical-challenge-role"
    }

  # module.eks.aws_internet_gateway.carguero-technical-challenger-ig will be created
  + resource "aws_internet_gateway" "carguero-technical-challenger-ig" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "carguero-technical-challenge-ig"
        }
      + tags_all = {
          + "Name"    = "carguero-technical-challenge-ig"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + vpc_id   = (known after apply)
    }

  # module.eks.aws_route_table.carguero-technical-challenger-rt will be created
  + resource "aws_route_table" "carguero-technical-challenger-rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "carguero-technical-challenge-routetable"
        }
      + tags_all         = {
          + "Name"    = "carguero-technical-challenge-routetable"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + vpc_id           = (known after apply)
    }

  # module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[0] will be created
  + resource "aws_route_table_association" "carguero-technical-challenger-rt-assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[1] will be created
  + resource "aws_route_table_association" "carguero-technical-challenger-rt-assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks.aws_subnet.carguero-technical-challenger-subnet[0] will be created
  + resource "aws_subnet" "carguero-technical-challenger-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "carguero-technical-challenge-subnet-1"
        }
      + tags_all                                       = {
          + "Name"    = "carguero-technical-challenge-subnet-1"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks.aws_subnet.carguero-technical-challenger-subnet[1] will be created
  + resource "aws_subnet" "carguero-technical-challenger-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "carguero-technical-challenge-subnet-2"
        }
      + tags_all                                       = {
          + "Name"    = "carguero-technical-challenge-subnet-2"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks.aws_vpc.carguero-technical-challenger-vpc will be created
  + resource "aws_vpc" "carguero-technical-challenger-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "carguero-technical-challenge-vpc"
        }
      + tags_all                             = {
          + "Name"    = "carguero-technical-challenge-vpc"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
    }

  # module.rds.aws_db_instance.carguero-technical-challenge-db will be created
  + resource "aws_db_instance" "carguero-technical-challenge-db" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "carguero-technical-challenge-db"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 30
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql5.7"
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + timezone                              = (known after apply)
      + username                              = "marcio"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_kms_key.carguero-technical-challenge-db-pass will be created
  + resource "aws_kms_key" "carguero-technical-challenge-db-pass" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "DB password"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marciojpacheco, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform plan`*